cesanta/mongoose-os/fw/platforms/stm32/src/stm32_gpio_defs.c
/* GENERATED FILE, DO NOT MODIFY */

#include "stm32_gpio_defs.h"

struct stm32_gpio_def stm32_gpio_defs[STM32_GPIO_NUM] = {
    {STM32_PIN_PA0, GPIOA, GPIO_PIN_0, "PA0", 0, {}, EXTI0_IRQn, 0},
    {STM32_PIN_PA1, GPIOA, GPIO_PIN_1, "PA1", 0, {}, EXTI1_IRQn, 0},
    {STM32_PIN_PA2, GPIOA, GPIO_PIN_2, "PA2", 0, {}, EXTI2_IRQn, 0},
    {STM32_PIN_PA3, GPIOA, GPIO_PIN_3, "PA3", 0, {}, EXTI3_IRQn, 0},
    {STM32_PIN_PA4, GPIOA, GPIO_PIN_4, "PA4", 0, {}, EXTI4_IRQn, 0},
    {STM32_PIN_PA5, GPIOA, GPIO_PIN_5, "PA5", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PA6, GPIOA, GPIO_PIN_6, "PA6", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PA7, GPIOA, GPIO_PIN_7, "PA7", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PA8, GPIOA, GPIO_PIN_8, "PA8", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PA9, GPIOA, GPIO_PIN_9, "PA9", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PA10, GPIOA, GPIO_PIN_10, "PA10", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PA11, GPIOA, GPIO_PIN_11, "PA11", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PA12, GPIOA, GPIO_PIN_12, "PA12", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PA13, GPIOA, GPIO_PIN_13, "PA13", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PA14, GPIOA, GPIO_PIN_14, "PA14", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PA15, GPIOA, GPIO_PIN_15, "PA15", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PB0, GPIOB, GPIO_PIN_0, "PB0", 0, {}, EXTI0_IRQn, 0},
    {STM32_PIN_PB1, GPIOB, GPIO_PIN_1, "PB1", 0, {}, EXTI1_IRQn, 0},
    {STM32_PIN_PB2, GPIOB, GPIO_PIN_2, "PB2", 0, {}, EXTI2_IRQn, 0},
    {STM32_PIN_PB3, GPIOB, GPIO_PIN_3, "PB3", 0, {}, EXTI3_IRQn, 0},
    {STM32_PIN_PB4, GPIOB, GPIO_PIN_4, "PB4", 0, {}, EXTI4_IRQn, 0},
    {STM32_PIN_PB5, GPIOB, GPIO_PIN_5, "PB5", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PB6, GPIOB, GPIO_PIN_6, "PB6", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PB7, GPIOB, GPIO_PIN_7, "PB7", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PB8, GPIOB, GPIO_PIN_8, "PB8", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PB9, GPIOB, GPIO_PIN_9, "PB9", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PB10, GPIOB, GPIO_PIN_10, "PB10", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PB11, GPIOB, GPIO_PIN_11, "PB11", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PB12, GPIOB, GPIO_PIN_12, "PB12", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PB13, GPIOB, GPIO_PIN_13, "PB13", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PB14, GPIOB, GPIO_PIN_14, "PB14", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PB15, GPIOB, GPIO_PIN_15, "PB15", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PC0, GPIOC, GPIO_PIN_0, "PC0", 0, {}, EXTI0_IRQn, 0},
    {STM32_PIN_PC1, GPIOC, GPIO_PIN_1, "PC1", 0, {}, EXTI1_IRQn, 0},
    {STM32_PIN_PC2, GPIOC, GPIO_PIN_2, "PC2", 0, {}, EXTI2_IRQn, 0},
    {STM32_PIN_PC3, GPIOC, GPIO_PIN_3, "PC3", 0, {}, EXTI3_IRQn, 0},
    {STM32_PIN_PC4, GPIOC, GPIO_PIN_4, "PC4", 0, {}, EXTI4_IRQn, 0},
    {STM32_PIN_PC5, GPIOC, GPIO_PIN_5, "PC5", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PC6, GPIOC, GPIO_PIN_6, "PC6", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PC7, GPIOC, GPIO_PIN_7, "PC7", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PC8, GPIOC, GPIO_PIN_8, "PC8", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PC9, GPIOC, GPIO_PIN_9, "PC9", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PC10, GPIOC, GPIO_PIN_10, "PC10", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PC11, GPIOC, GPIO_PIN_11, "PC11", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PC12, GPIOC, GPIO_PIN_12, "PC12", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PC13, GPIOC, GPIO_PIN_13, "PC13", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PC14, GPIOC, GPIO_PIN_14, "PC14", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PC15, GPIOC, GPIO_PIN_15, "PC15", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PD0, GPIOD, GPIO_PIN_0, "PD0", 0, {}, EXTI0_IRQn, 0},
    {STM32_PIN_PD1, GPIOD, GPIO_PIN_1, "PD1", 0, {}, EXTI1_IRQn, 0},
    {STM32_PIN_PD2, GPIOD, GPIO_PIN_2, "PD2", 0, {}, EXTI2_IRQn, 0},
    {STM32_PIN_PD3, GPIOD, GPIO_PIN_3, "PD3", 0, {}, EXTI3_IRQn, 0},
    {STM32_PIN_PD4, GPIOD, GPIO_PIN_4, "PD4", 0, {}, EXTI4_IRQn, 0},
    {STM32_PIN_PD5, GPIOD, GPIO_PIN_5, "PD5", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PD6, GPIOD, GPIO_PIN_6, "PD6", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PD7, GPIOD, GPIO_PIN_7, "PD7", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PD8, GPIOD, GPIO_PIN_8, "PD8", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PD9, GPIOD, GPIO_PIN_9, "PD9", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PD10, GPIOD, GPIO_PIN_10, "PD10", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PD11, GPIOD, GPIO_PIN_11, "PD11", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PD12, GPIOD, GPIO_PIN_12, "PD12", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PD13, GPIOD, GPIO_PIN_13, "PD13", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PD14, GPIOD, GPIO_PIN_14, "PD14", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PD15, GPIOD, GPIO_PIN_15, "PD15", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PE0, GPIOE, GPIO_PIN_0, "PE0", 0, {}, EXTI0_IRQn, 0},
    {STM32_PIN_PE1, GPIOE, GPIO_PIN_1, "PE1", 0, {}, EXTI1_IRQn, 0},
    {STM32_PIN_PE2, GPIOE, GPIO_PIN_2, "PE2", 0, {}, EXTI2_IRQn, 0},
    {STM32_PIN_PE3, GPIOE, GPIO_PIN_3, "PE3", 0, {}, EXTI3_IRQn, 0},
    {STM32_PIN_PE4, GPIOE, GPIO_PIN_4, "PE4", 0, {}, EXTI4_IRQn, 0},
    {STM32_PIN_PE5, GPIOE, GPIO_PIN_5, "PE5", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PE6, GPIOE, GPIO_PIN_6, "PE6", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PE7, GPIOE, GPIO_PIN_7, "PE7", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PE8, GPIOE, GPIO_PIN_8, "PE8", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PE9, GPIOE, GPIO_PIN_9, "PE9", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PE10, GPIOE, GPIO_PIN_10, "PE10", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PE11, GPIOE, GPIO_PIN_11, "PE11", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PE12, GPIOE, GPIO_PIN_12, "PE12", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PE13, GPIOE, GPIO_PIN_13, "PE13", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PE14, GPIOE, GPIO_PIN_14, "PE14", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PE15, GPIOE, GPIO_PIN_15, "PE15", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PF0, GPIOF, GPIO_PIN_0, "PF0", 0, {}, EXTI0_IRQn, 0},
    {STM32_PIN_PF1, GPIOF, GPIO_PIN_1, "PF1", 0, {}, EXTI1_IRQn, 0},
    {STM32_PIN_PF2, GPIOF, GPIO_PIN_2, "PF2", 0, {}, EXTI2_IRQn, 0},
    {STM32_PIN_PF3, GPIOF, GPIO_PIN_3, "PF3", 0, {}, EXTI3_IRQn, 0},
    {STM32_PIN_PF4, GPIOF, GPIO_PIN_4, "PF4", 0, {}, EXTI4_IRQn, 0},
    {STM32_PIN_PF5, GPIOF, GPIO_PIN_5, "PF5", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PF6, GPIOF, GPIO_PIN_6, "PF6", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PF7, GPIOF, GPIO_PIN_7, "PF7", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PF8, GPIOF, GPIO_PIN_8, "PF8", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PF9, GPIOF, GPIO_PIN_9, "PF9", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PF10, GPIOF, GPIO_PIN_10, "PF10", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PF11, GPIOF, GPIO_PIN_11, "PF11", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PF12, GPIOF, GPIO_PIN_12, "PF12", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PF13, GPIOF, GPIO_PIN_13, "PF13", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PF14, GPIOF, GPIO_PIN_14, "PF14", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PF15, GPIOF, GPIO_PIN_15, "PF15", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PG0, GPIOG, GPIO_PIN_0, "PG0", 0, {}, EXTI0_IRQn, 0},
    {STM32_PIN_PG1, GPIOG, GPIO_PIN_1, "PG1", 0, {}, EXTI1_IRQn, 0},
    {STM32_PIN_PG2, GPIOG, GPIO_PIN_2, "PG2", 0, {}, EXTI2_IRQn, 0},
    {STM32_PIN_PG3, GPIOG, GPIO_PIN_3, "PG3", 0, {}, EXTI3_IRQn, 0},
    {STM32_PIN_PG4, GPIOG, GPIO_PIN_4, "PG4", 0, {}, EXTI4_IRQn, 0},
    {STM32_PIN_PG5, GPIOG, GPIO_PIN_5, "PG5", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PG6, GPIOG, GPIO_PIN_6, "PG6", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PG7, GPIOG, GPIO_PIN_7, "PG7", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PG8, GPIOG, GPIO_PIN_8, "PG8", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PG9, GPIOG, GPIO_PIN_9, "PG9", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PG10, GPIOG, GPIO_PIN_10, "PG10", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PG11, GPIOG, GPIO_PIN_11, "PG11", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PG12, GPIOG, GPIO_PIN_12, "PG12", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PG13, GPIOG, GPIO_PIN_13, "PG13", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PG14, GPIOG, GPIO_PIN_14, "PG14", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PG15, GPIOG, GPIO_PIN_15, "PG15", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PH0, GPIOH, GPIO_PIN_0, "PH0", 0, {}, EXTI0_IRQn, 0},
    {STM32_PIN_PH1, GPIOH, GPIO_PIN_1, "PH1", 0, {}, EXTI1_IRQn, 0},
    {STM32_PIN_PH2, GPIOH, GPIO_PIN_2, "PH2", 0, {}, EXTI2_IRQn, 0},
    {STM32_PIN_PH3, GPIOH, GPIO_PIN_3, "PH3", 0, {}, EXTI3_IRQn, 0},
    {STM32_PIN_PH4, GPIOH, GPIO_PIN_4, "PH4", 0, {}, EXTI4_IRQn, 0},
    {STM32_PIN_PH5, GPIOH, GPIO_PIN_5, "PH5", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PH6, GPIOH, GPIO_PIN_6, "PH6", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PH7, GPIOH, GPIO_PIN_7, "PH7", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PH8, GPIOH, GPIO_PIN_8, "PH8", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PH9, GPIOH, GPIO_PIN_9, "PH9", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PH10, GPIOH, GPIO_PIN_10, "PH10", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PH11, GPIOH, GPIO_PIN_11, "PH11", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PH12, GPIOH, GPIO_PIN_12, "PH12", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PH13, GPIOH, GPIO_PIN_13, "PH13", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PH14, GPIOH, GPIO_PIN_14, "PH14", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PH15, GPIOH, GPIO_PIN_15, "PH15", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PI0, GPIOI, GPIO_PIN_0, "PI0", 0, {}, EXTI0_IRQn, 0},
    {STM32_PIN_PI1, GPIOI, GPIO_PIN_1, "PI1", 0, {}, EXTI1_IRQn, 0},
    {STM32_PIN_PI2, GPIOI, GPIO_PIN_2, "PI2", 0, {}, EXTI2_IRQn, 0},
    {STM32_PIN_PI3, GPIOI, GPIO_PIN_3, "PI3", 0, {}, EXTI3_IRQn, 0},
    {STM32_PIN_PI4, GPIOI, GPIO_PIN_4, "PI4", 0, {}, EXTI4_IRQn, 0},
    {STM32_PIN_PI5, GPIOI, GPIO_PIN_5, "PI5", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PI6, GPIOI, GPIO_PIN_6, "PI6", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PI7, GPIOI, GPIO_PIN_7, "PI7", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PI8, GPIOI, GPIO_PIN_8, "PI8", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PI9, GPIOI, GPIO_PIN_9, "PI9", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PI10, GPIOI, GPIO_PIN_10, "PI10", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PI11, GPIOI, GPIO_PIN_11, "PI11", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PI12, GPIOI, GPIO_PIN_12, "PI12", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PI13, GPIOI, GPIO_PIN_13, "PI13", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PI14, GPIOI, GPIO_PIN_14, "PI14", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PI15, GPIOI, GPIO_PIN_15, "PI15", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PJ0, GPIOJ, GPIO_PIN_0, "PJ0", 0, {}, EXTI0_IRQn, 0},
    {STM32_PIN_PJ1, GPIOJ, GPIO_PIN_1, "PJ1", 0, {}, EXTI1_IRQn, 0},
    {STM32_PIN_PJ2, GPIOJ, GPIO_PIN_2, "PJ2", 0, {}, EXTI2_IRQn, 0},
    {STM32_PIN_PJ3, GPIOJ, GPIO_PIN_3, "PJ3", 0, {}, EXTI3_IRQn, 0},
    {STM32_PIN_PJ4, GPIOJ, GPIO_PIN_4, "PJ4", 0, {}, EXTI4_IRQn, 0},
    {STM32_PIN_PJ5, GPIOJ, GPIO_PIN_5, "PJ5", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PJ6, GPIOJ, GPIO_PIN_6, "PJ6", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PJ7, GPIOJ, GPIO_PIN_7, "PJ7", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PJ8, GPIOJ, GPIO_PIN_8, "PJ8", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PJ9, GPIOJ, GPIO_PIN_9, "PJ9", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PJ10, GPIOJ, GPIO_PIN_10, "PJ10", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PJ11, GPIOJ, GPIO_PIN_11, "PJ11", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PJ12, GPIOJ, GPIO_PIN_12, "PJ12", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PJ13, GPIOJ, GPIO_PIN_13, "PJ13", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PJ14, GPIOJ, GPIO_PIN_14, "PJ14", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PJ15, GPIOJ, GPIO_PIN_15, "PJ15", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PK0, GPIOK, GPIO_PIN_0, "PK0", 0, {}, EXTI0_IRQn, 0},
    {STM32_PIN_PK1, GPIOK, GPIO_PIN_1, "PK1", 0, {}, EXTI1_IRQn, 0},
    {STM32_PIN_PK2, GPIOK, GPIO_PIN_2, "PK2", 0, {}, EXTI2_IRQn, 0},
    {STM32_PIN_PK3, GPIOK, GPIO_PIN_3, "PK3", 0, {}, EXTI3_IRQn, 0},
    {STM32_PIN_PK4, GPIOK, GPIO_PIN_4, "PK4", 0, {}, EXTI4_IRQn, 0},
    {STM32_PIN_PK5, GPIOK, GPIO_PIN_5, "PK5", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PK6, GPIOK, GPIO_PIN_6, "PK6", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PK7, GPIOK, GPIO_PIN_7, "PK7", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PK8, GPIOK, GPIO_PIN_8, "PK8", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PK9, GPIOK, GPIO_PIN_9, "PK9", 0, {}, EXTI9_5_IRQn, 0},
    {STM32_PIN_PK10, GPIOK, GPIO_PIN_10, "PK10", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PK11, GPIOK, GPIO_PIN_11, "PK11", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PK12, GPIOK, GPIO_PIN_12, "PK12", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PK13, GPIOK, GPIO_PIN_13, "PK13", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PK14, GPIOK, GPIO_PIN_14, "PK14", 0, {}, EXTI15_10_IRQn, 0},
    {STM32_PIN_PK15, GPIOK, GPIO_PIN_15, "PK15", 0, {}, EXTI15_10_IRQn, 0},
};

uint16_t stm32_pins[STM32_PIN_NUM] = {
    GPIO_PIN_0,  GPIO_PIN_1,  GPIO_PIN_2,  GPIO_PIN_3,
    GPIO_PIN_4,  GPIO_PIN_5,  GPIO_PIN_6,  GPIO_PIN_7,
    GPIO_PIN_8,  GPIO_PIN_9,  GPIO_PIN_10, GPIO_PIN_11,
    GPIO_PIN_12, GPIO_PIN_13, GPIO_PIN_14, GPIO_PIN_15,
};
